app/controllers/api/restaurants_controller.rb

  def show
    @restaurant = Restaurant.find_by(id: params[:id]) if params[:id]
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]