app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @restaurant = Restaurant.find_by(id: params[:id]) if params[:id]