app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "demo@user.io"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."phone_number" = $1 LIMIT $2  [["phone_number", "9175796833"], ["LIMIT", 1]]
---
    def self.find_by_credentials(credential)

        if credential.split("@").length > 1
            user = User.find_by(email: credential)
        else
            user = User.find_by(phone_number: credential)

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token
        while
            token = SecureRandom.urlsafe_base64
        return token unless User.exists?(session_token: token)